using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Controls.Primitives;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Forms;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Navigation;
using System.Windows.Shapes;

using FireSharp.Config;
using FireSharp.Interfaces;
using FireSharp.Response;

namespace MishaTest
{
    /// <summary>
    /// Логика взаимодействия для MainWindow.xaml
    /// </summary>
    public partial class MainWindow : Window
    {
        IFirebaseConfig config = new FirebaseConfig
        {
            AuthSecret = "jd18AAgjGJbiAdxfbEkmvjPzwooe8k4b2eKuP2vS",
            BasePath = "https://adaptability200-default-rtdb.europe-west1.firebasedatabase.app/"
        };

        IFirebaseClient client;

        Person person = new Person();

        string[] questions = new string[200]

            {
                "Буває, що я серджуся", // 1
                "Зазвичай вранцi я прокидаюся свiжим i вiдпочилим", // 2
                "Зараз я приблизно так само працездатний, як i завжди", // 3
                "Доля безумовно несправедлива до мене", // 4
                "Запори у мене бувають дуже рiдко", // 5
                "Часом менi дуже хотiлося покинути свiй дiм", // 6
                "Часом у мене бувають напади смiху або плачу, з якими я нiяк не можу справитися", // 7
                "Менi здається, що мене нiхто не розумiє", // 8
                "Вважаю, що якщо хтось заподiяв менi зло, я повинен йому вiдповiсти тим же", // 9
                "Інодi менi в голову приходять такi нехорошi думки, що краще про них нiкому не розказувати", //10
                "Менi важко зосередитися на якому-небудь завданнi або роботi", // 11
                "У мене бувають дуже дивнi i незвичайнi переживання", // 12
                "У мене були вiдсутнi неприємностi через мою поведiнку", // 13
                "В дитинствi я у свiй час скоював дрiбнi крадiжки", // 14
                "Буває, у мене з’являється бажання ламати або крушити все навколо", // 15
                "Бувало, що я цiлими днями або навiть тижнями нiчого не мiг робити, тому що нiяк не мiг примусити себе взятися до роботи", // 16
                "Сон у мене переривистий i неспокiйний", // 17
                "Моя сiм’я вiдноситися з несхваленням до тiєї роботи, яку я обрав", // 18
                "Бували випадки, що я не виконував своїх обiцянок", // 19
                "Голова у мене болить часто", // 20
                "Раз на тиждень або частiше я без жодної видимої причини раптово вiдчуваю жар у всьому тiлi", // 21
                "Було б добре, якби майже всi закони вiдмiнили", // 22
                "Стан мого здоров’я майже такий же, як у бiльшостi моїх знайомих (не гiрше)", // 23
                "Зустрiчаючи на вулицi своїх знайомих або шкiльних друзiв, з якими я давно не бачився, я вважаю за краще проходити мимо, якщо вони зi мною не заговорюють першими", // 24
                "Бiльшостi людей, якi мене знають, я подобаюся", // 25
                "Я людина товариська", // 26
                "Інодi я так наполягаю на своєму, що люди втрачають терпiння", // 27
                "Значну частину часу настрiй у мене пригнiчений", // 28
                "Тепер менi важко сподiватися на те, що я чого-небудь досягну у життi", // 29 
                "У мене мало впевненостi в собi", // 30
                "Інодi я кажу неправду", // 31
                "Зазвичай я вважаю, що життя – гарна рiч", // 32
                "Я вважаю, що бiльшiсть людей здатна збрехати, щоб просунутися по службi", // 33
                "Я охоче беру участь у зiбраннях, зборах i iнших суспiльних заходах", // 34
                "Я сварюся з членами моєї сiм’ї дуже рiдко", // 35
                "Інодi у мене виникає сильне бажання порушити правила пристойностi або кому-небудь нашкодити", // 36
                "Найважча боротьба для мене - це боротьба з самим собою", // 37
                "М’язовi судоми або сiпання у мене бувають украй рiдко (або майже не бувають)", // 38
                "Я досить байдужий до того, що зi мною буде", // 39
                "Інодi, коли я себе недобре вiдчуваю я буваю дратiвливим", // 40
                "Значну частину часу у мене таке вiдчуття, що я зробив щось не те або навiть щось погане", // 41
                "Деякi люди до того полюбляють командувати, що менi так i кортить робити все наперекiр, навiть якщо я знаю, що вони мають рацiю", // 42
                "Я часто вважаю себе зобов’язаним вiдстоювати те, що вважаю справедливим", // 43
                "Моя мова зараз така ж як завжди (нi швидше i нi повiльнiше, немає нi хрипоти, нi невиразностi)", // 44
                "Я вважаю, що моє сiмейне життя таке ж добре, як у бiльшостi моїх знайомих", // 45
                "Мене вкрай зачiпає, коли мене критикують або лають", // 46
                "Інодi у мене буває таке вiдчуття, що я просто повинен нанести ушкодження собi або кому-небудь iншому", // 47
                "Моя поведiнка значною мiрою визначається звичаями тих, хто мене оточує", // 48
                "В дитинствi у мене була така компанiя, де всi прагнули стояти один за одного", // 49
                "Інодi менi так i кортить з ким-небудь затiяти бiйку", // 50
                "Бувало, що я казав про речi, в яких не розбираюся", // 51
                "Зазвичай я засинаю спокiйно i мене не турбують нiякi думки", // 52
                "Останнi декiлька рокiв я вiдчуваю себе добре", // 53
                "У мене нiколи не було нi припадкiв, нi судом", // 54
                "Зараз моя вага постiйна (я не худну i не повнiшаю)", // 55
                "Я вважаю, що мене часто карали нiзащо", // 56
                "Я легко плачу", // 57
                "Я мало втомлююся", // 58
                "Я був би досить спокiйний, якби у кого-небудь з моєї сiм’ї були неприємностi через порушення закону", // 59
                "З моїм розумом творитися щось недобре", // 60
                "Щоб приховати свою сором’язливiсть менi доводиться докладати великi зусилля", // 61
                "Напади запаморочення у мене бувають дуже рiдко (або майже не бувають)", // 62
                "Мене турбують сексуальнi (статевi) питання", // 63
                "Менi важко пiдтримувати розмову з людьми, з якими я тiльки що познайомився", // 64
                "Коли я намагаюся щось зробити, то часто помiчаю, що у мене тремтять руки", // 65
                "Руки у мене такi ж спритнi i моторнi, як i ранiше", // 66
                "Велику частину часу я вiдчуваю загальну слабкiсть", // 67
                "Інодi, коли я збентежений я сильно вкриваюся потом i мене це дратує", // 68
                "Буває, що я вiдкладаю на завтра те, що повинен зробити сьогоднi", // 69
                "Думаю, що я людина приречена", // 70
                "Бували випадки, що менi було важке утриматися вiд того, щоб що-небудь не поцупити в кого-небудь або де-небудь, наприклад у магазинi", // 71
                "Я зловживав спиртними напоями", // 72
                "Я часто про що-небудь турбуюся", // 73
                "Менi б хотiлося бути членом декiлькох кружкiв або зборiв", // 74
                "Я рiдко задихаюся, i у мене не буває сильного серцебиття", // 75
                "Все своє життя я суворо дотримуюсь принципiв, заснованих на почуттi обов’язку", // 76
                "Траплялося, що я перешкоджав або поступав наперекiр людям просто iз принципу, а не тому, що справа була дiйсно важливою", // 77
                "Якщо менi не загрожує штраф i машин поблизу немає, я можу перейти вулицю там, де бажаю, а не там де потрiбно", // 78
                "Я завжди був незалежним i вiльним вiд контролю з боку сiм’ї", // 79
                "У мене бували перiоди такої сильної стурбованостi, що я навiть не мiг всидiти на мiсцi", // 80
                "Часто мої вчинки тлумачилися не вiрно", // 81
                "Мої батьки i (або) iншi члени моєї сiм’ї прискiпуються до мене бiльше, нiж треба", // 82
                "Хтось керує моїми думками", // 83
                "Люди байдужi до того, що з тобою трапиться", // 84
                "Менi подобається бути в компанiї, де всi жартують один над одним", // 85
                "В школi я засвоював матерiал повiльнiше, анiж iншi", // 86
                "Я цiлком впевнений у собi", // 87
                "Нiкому не довiряти – найбезпечнiше", // 88
                "Раз на тиждень або частiше я буваю дуже збудженим i схвильованим", // 89
                "Коли я знаходжуся в компанiї, менi важко знайти вiдповiдну тему для розмови", // 90
                "Менi легко примусити iнших людей боятися мене, i iнодi я це роблю ради забави", // 91
                "У грi я вважаю за краще вигравати", // 92
                "Безглуздо засуджувати людину, яка обдурила того, хто сам дозволяє себе обдурювати", // 93
                "Хтось намагається впливати на мої думки", // 94
                "Я щодня випиваю багато води", // 95
                "Щасливiше всього я буваю наодинцi", // 96
                "Я обурююся кожного разу, коли дiзнаюся, що злочинець з якої-небудь причини залишився безкарним", // 97
                "У моєму життi був один або декiлька випадкiв, коли я вiдчував, що хтось за допомогою гiпнозу примушує мене скоювати тi або iншi вчинки", // 98
                "Я дуже рiдко заговорюю з людьми першим", // 99
                "У мене нiколи не було зiткнень iз законом", // 100
                "Менi приємно мати серед своїх знайомих значних людей, це як би додає менi вагу у власних очах", // 101
                "Інодi без жодної причини у мене раптом наступають перiоди незвичайної веселостi", // 102
                "Життя для мене майже завжди пов’язано з напругою", // 103
                "У школi менi було дуже важко виступати перед класом", // 104
                "Люди проявляють по вiдношеннi до мене стiльки спiвчуття i симпатiї, наскiльки я заслуговую", // 105
                "Я вiдмовляюся грати в деякi iгри, тому що це у мене погано виходить", // 106
                "Менi здається, що я знаходжу друзiв з такою ж легкiстю, як i iншi", // 107
                "Менi неприємно, коли навколо мене є люди", // 108
                "Як правило, менi не везе", // 109
                "Мене легко збити з пантелику", // 110
                "Деякi з членiв моєї сiм’ї скоювали вчинки, якi мене лякали", // 111
                "Інодi у мене бувають напади смiху або плачу, з якими я нiяк не можу справитися", // 112
                "Менi важко приступити до виконання нового завдання або розпочати нову справу", // 113
                "Якби люди не були налаштованi проти мене, я досягнув би у життi набагато бiльшого", // 114
                "Менi здається, що мене нiхто не розумiє", // 115
                "Серед моїх знайомих є люди, якi менi не подобаються", // 116
                "Я легко втрачаю терпiння з людьми", // 117
                "Часто у новiй обстановцi я переживаю почуття тривоги", // 118
                "Часто менi хочеться померти", // 119
                "Інодi я такий збуджений, що менi важко заснути", // 120
                "Часто я переходжу на іншу сторону вулиці, щоб уникнути зустрічі з тим, кого я побачив", // 121
                "Бувало, що я кидав почату справу, оскiльки боявся, що я не справлюся з нею", // 122
                "Майже щодня трапляється що-небудь, що лякає мене", // 123
                "Навiть серед людей я зазвичай вiдчуваю себе самотнiм", // 124
                "Я переконаний, що iснує лише одне єдине правильне розумiння значення життя", // 125
                "В гостях я частiше сиджу де-небудь осторонь або розмовляю з ким-небудь одним, нiж беру участь у загальних розвагах", // 126
                "Менi часто кажуть, що я запальний", // 127
                "Буває, що я з ким-небудь плiткую", // 128
                "Часто менi неприємно, коли я намагаюся застерегти кого-небудь вiд помилок, а мене розумiють неправильно", // 129
                "Я часто звертаюся до людей за порадою", // 130
                "Часто, навiть тодi, коли усе для мене складається добре, я вiдчуваю що менi усе байдуже", // 131
                "Мене досить важко вивести з себе", // 132
                "Коли я намагаюся вказати людям на їх помилки або допомогти вони часто розумiють мене неправильно", // 133
                "Зазвичай я спокiйний, i мене нелегко вивести з душевної рiвноваги", // 134
                "Я заслуговую суворого покарання за свою провину", // 135
                "Менi притаманно так сильно переживати свої розчарування, що я не можу примусити себе не думати про них", // 136
                "Часом менi здається, що я нi на що не здатний", // 137 
                "Бувало, що пiд час обговорення деяких питань я, особливо не замислюючись, погоджувався з думкою iнших", // 138
                "Мене дуже турбують рiзного роду нещастя", // 139
                "Мої переконання i погляди непохитнi", // 140
                "Я вважаю, що можна не порушуючи закон спробувати знайти в ньому лазiвку", // 141
                "Є люди, якi менi настiльки неприємнi, що я в глибинi душi радiю, коли вони одержують прочухан за що-небудь", // 142
                "У мене бували перiоди, коли через хвилювання я втрачав сон", // 143
                "Я вiдвiдую рiзнi суспiльнi заходи, тому що це дозволяє бувати менi серед людей", // 144
                "Можна пробачити людям порушення тих правил, якi вони вважають нерозсудливими", // 145
                "У мене є поганi звички, якi є настiльки сильними, що боротися з ними просто марно", // 146
                "Я охоче знайомлюся з новими людьми", // 147
                "Буває, що непристойний жарт у мене викликає смiх", // 148
                "Якщо справа йде у мене погано, то менi вiдразу хочеться все кинути", // 149
                "Я вважаю за краще дiяти вiдповiдно до власних планiв, а не слiдувати вказiвкам iнших", // 150
                "Менi подобається, коли оточуючi знають мою точку зору.", // 151
                "Якщо я поганої думки про людину або навiть зневажаю його, я мало прагну приховати це вiд нього", // 152
                "Я людина нервова i легко збудлива", // 153
                "Все у мене виходить погано, не так як треба", // 154
                "Майбутнє здається менi безнадiйним", // 155
                "Люди досить легко можуть змiнити мою думку, навiть якщо до цього вона здавалася менi остаточною", // 156
                "Кiлька разiв на тиждень у мене буває таке вiдчуття, що повинно трапитися щось жахливе", // 157
                "Значну частину часу я вiдчуваю себе втомленим", // 158
                "Я люблю бувати на вечорах i просто в компанiях", // 159
                "Я прагну вiдхилитися вiд конфлiктiв i скрутних положень", // 160
                "Мене дуже дратує те, що я забуваю, куди кладу речi", // 161
                "Пригодницькi розповiдi менi подобаються бiльше, нiж розповiдi про любов", // 162
                "Якщо я схочу зробити щось, але оточуючi вважають, що цього робити не варто, я можу легко вiдмовитися вiд своїх намiрiв", // 163
                "Безглуздо засуджувати людей, якi прагнуть урвати вiд життя все, що можуть", // 164
                "Менi байдуже, що про мене думають iншi", // 165
                "Я абсолютно не пристосований до вiйськової служби i це мене дуже лякає", // 166
                "Я переконаний, що чоловiки повиннi служити у Збройних Силах тiльки за власним бажанням", // 167
                "Останнiм часом у мене все частiше i частiше трапляються „промахи” i невдачi по службi.", // 168
                "Найбiльшi труднощi для мене пiд час служби – це необхiднiсть пiдкорятися командирам i начальникам", // 169
                "Тим правилами, якi, на мiй погляд, несправедливi, я завжди прагну протидiяти", // 170
                "Менi хотiлося б випробувати себе серйозною i небезпечною справою", // 171
                "Мене довго не залишає вiдчуття образи, заподiяне товаришами", // 172
                "Жити за вiйськовим розпорядком для мене просто нестерпно", // 173
                "Я сумнiваюся, чи зможу я зi своїм здоров'ям витримати всi навантаження вiйськової служби", // 174
                "Я заздрю тим, хто змiг ухилитися вiд вiйськової служби", // 175
                "Я вiдчуваю все бiльше i бiльше розчарувань по вiдношенню до моєї вiйськової спецiальностi", // 176
                "Я часто розгублююся у складних i небезпечних ситуацiях", // 177
                "Менi хотiлося б служити у ПДВ або частинах спецназу", // 178
                "Із службою у мене нiщо не виходить (не „клеїться”). Часто думаю: „не моя це справа”", // 179
                "Коли мною хтось командує, це викликає у мене вiдчуття протесту", // 180
                "Менi завжди було важко пристосовуватися до нового колективу", // 181
                "Пiд час подальшої служби я був би не проти послужити там, де небезпечно i де ведуться бойовi дiї", // 182
                "Присяга на вiрнiсть Вiтчизнi у сучасних умовах втратила свою актуальнiсть", // 183
                "Менi завжди було нелегко пристосовуватися до нових умов життя", // 184 
                "У складних ситуацiях я не можу швидко приймати правильнi рiшення", // 185
                "Я упевнений, що в майбутньому не стану укладати або продовжувати контракт на продовження вiйськової служби", // 186
                "У мене бувають перiоди похмурої дратiвливостi, пiд час яких я „зриваю зло” на оточуючих", // 187
                "Я насилу витримую фiзичнi навантаження, пов’язанi з моєю професiйною дiяльнiстю", // 188
                "Я достатньо спокiйно вiдношуся до необхiдностi брати участь в тривалих i небезпечних вiдрядженнях", // 189
                "Навряд чи я схочу присвятити все своє життя вiйськовiй професiї (залишитися на службу за контрактом, поступити у вiйськове училище)", // 190
                "„За компанiю” з товаришами я можу прийняти неабияку кiлькiсть алкоголю (перевищити свою звичайну „норму”)", // 191
                "У компанiях, де я часто буваю, друзi iнодi палять „травичку”. Я їх за це не засуджую", // 192
                "Останнiм часом, щоб не „зiрватися”, я був вимушений приймати заспокiйливi лiки", // 193
                "Мої батьки (родичi) часто виказували побоювання у зв'язку з моїми випивками", // 194
                "Немає нiчого поганого, коли люди намагаються випробувати на собi незвичайнi стани, приймаючи деякi речовини", // 195
                "У станi агресiї я здатний багато на що", // 196
                "Я крутий i жорстокий з оточуючими", // 197
                "Якщо хтось заподiяв менi зло, я вважаю зобов’язаним вiдплатити йому тим же („око за око, зуб за зуб”)", // 198
                "Можна погодитися з тим, що я не дуже-то схильний виконувати багато наказiв, вважаючи їх безрозсудними", // 199
                "Я думаю, що будь-яке положення законiв i вiйськових статутiв можна тлумачити двояко", // 200 
            };

        string[] answers = new string[200];
        int i = 0;

        public MainWindow()
        {
            InitializeComponent();
            client = new FireSharp.FirebaseClient(config);

            if (client != null)
            {
                System.Windows.MessageBox.Show("Соединение с Базой Данных установленно епты бля");
            }

            ShowResult.IsEnabled = false;
        }

        public void Results()
        {
            person.D = 0;
            person.PR = 0;
            person.KP = 0;
            person.MN = 0;
            person.VPS = 0;
            person.DAP = 0;
            person.SR = 0;

            string res = string.Empty;

            for (int i = 0; i < answers.Length; i++)
            {
                int q = i + 1;
                #region Test Keys
                bool D_Key = (q == 1 || q == 10 || q == 19 || q == 31 || q == 51 || q == 69 || q == 78 || q == 92 || q == 101 || q == 116 || q == 128 || q == 138 || q == 148) && string.Equals(answers[i], "NO");

                bool PR_Key1 = (q == 4 || q == 6 || q == 7 || q == 8 || q == 11 || q == 12 || q == 15 || q == 16 || q == 17 || q == 18 || q == 20 || q == 21 || q == 28 || q == 29 || q == 30 || q == 36 || q == 37 || q == 39 || q == 40 || q == 41 || q == 47 || q == 57 || q == 60 || q == 63 || q == 65 || q == 67 || q == 68 || q == 70 || q == 73 || q == 80 || q == 82 || q == 83 || q == 84 || q == 86 || q == 89 || q == 94 || q == 95 || q == 96 || q == 98 || q == 102 || q == 103 || q == 108 || q == 109 || q == 110 || q == 111 || q == 112 || q == 113 || q == 115 || q == 117 || q == 118 || q == 119 || q == 120 || q == 122 || q == 123 || q == 124 || q == 125 || q == 127 || q == 129 || q == 131 || q == 135 || q == 136 || q == 137 || q == 139 || q == 143 || q == 146 || q == 149 || q == 153 || q == 154 || q == 155 || q == 156 || q == 157 || q == 158 || q == 161 || q == 162) && string.Equals(answers[i], "YES");
                bool PR_Key2 = (q == 2 || q == 3 || q == 5 || q == 23 || q == 25 || q == 32 || q == 38 || q == 44 || q == 45 || q == 52 || q == 53 || q == 54 || q == 55 || q == 58 || q == 62 || q == 66 || q == 75 || q == 87 || q == 105 || q == 132 || q == 134 || q == 140) && string.Equals(answers[i], "NO");

                bool KP_Key1 = (q == 9 || q == 24 || q == 27 || q == 43 || q == 46 || q == 61 || q == 64 || q == 81 || q == 88 || q == 90 || q == 99 || q == 104 || q == 106 || q == 114 || q == 121 || q == 126 || q == 133 || q == 142 || q == 151 || q == 152) && string.Equals(answers[i], "YES");
                bool KP_Key2 = (q == 26 || q == 34 || q == 35 || q == 48 || q == 49 || q == 74 || q == 85 || q == 107 || q == 130 || q == 144 || q == 147 || q == 159) && string.Equals(answers[i], "NO");

                bool MN_Key1 = (q == 14 || q == 22 || q == 33 || q == 42 || q == 50 || q == 56 || q == 59 || q == 71 || q == 72 || q == 77 || q == 79 || q == 91 || q == 93 || q == 141 || q == 145 || q == 150 || q == 164 || q == 165) && string.Equals(answers[i], "YES");
                bool MN_Key2 = (q == 13 || q == 76 || q == 97 || q == 100 || q == 160 || q == 163) && string.Equals(answers[i], "NO");

                bool VPS_Key1 = (q == 166 || q == 167 || q == 168 || q == 169 || q == 170 || q == 172 || q == 173 || q == 174 || q == 175 || q == 176 || q == 177 || q == 179 || q == 180 || q == 181 || q == 183 || q == 184 || q == 185 || q == 186 || q == 187 || q == 188 || q == 190) && string.Equals(answers[i], "YES");
                bool VPS_Key2 = (q == 171 || q == 178 || q == 182 || q == 189) && string.Equals(answers[i], "NO");

                bool DAP_Key1 = (q == 6 || q == 9 || q == 14 || q == 15 || q == 22 || q == 36 || q == 39 || q == 42 || q == 47 || q == 50 || q == 56 || q == 59 || q == 71 || q == 72 || q == 91 || q == 93 || q == 117 || q == 127 || q == 141 || q == 145 || q == 151 || q == 152 || q == 164 || q == 191 || q == 192 || q == 193 || q == 194 || q == 195 || q == 196 || q == 197 || q == 198 || q == 199 || q == 200) && string.Equals(answers[i], "YES");
                bool DAP_Key2 = (q == 13 || q == 100 || q == 163) && string.Equals(answers[i], "NO");

                bool SR_Key1 = (q == 4 || q == 8 || q == 10 || q == 28 || q == 29 || q == 39 || q == 41 || q == 47 || q == 70 || q == 84 || q == 115 || q == 119 || q == 124 || q == 136 || q == 137 || q == 149 || q == 154 || q == 155) && string.Equals(answers[i], "YES");
                bool SR_Key2 = (q == 32 || q == 105) && string.Equals(answers[i], "NO");
                #endregion

                if (D_Key) person.D++;
                if (PR_Key1 || PR_Key2) person.PR++;
                if (KP_Key1 || KP_Key2) person.KP++;
                if (MN_Key1 || MN_Key2) person.MN++;
                if (VPS_Key1 || VPS_Key2) person.VPS++;
                if (DAP_Key1 || DAP_Key2) person.DAP++;
                if (SR_Key1 || SR_Key2) person.SR++;

                person.OAP = person.PR + person.KP + person.MN;
            }
            System.Windows.MessageBox.Show("достовiрнiсть " + person.D + "\nОАП " + person.OAP + "\nпсихiчна регуляцiя " + person.PR + "\nкомунiкативний потенцiал " + person.KP + "\nморальна нормативнiсть " + person.MN + "\nвiйськово-професiйна спрямованiсть " + person.VPS + "\nсхильнiсть до девiантних форм поведiнки " + person.DAP + "\nсуїцидальний ризик " + person.SR);
            System.Windows.MessageBox.Show(D_Result(person.D) + "\n\n" + OAP_Result(person.OAP) + "\n\n" + PR_Result(person.PR) + "\n\n" + KP_Result(person.KP) + "\n\n" + MN_Result(person.MN) + "\n\n" + VPS_Result(person.VPS) + "\n\n" + DAP_Result(person.DAP) + "\n\n" + SR_Result(person.SR));
        }

        public void Yes_Click(object sender, RoutedEventArgs e)
        {
            if (i + 1 > 200)
            {
                Yes.IsEnabled = false;
                No.IsEnabled = false;
                ShowResult.IsEnabled = true;
            }
            else
            {
                QuestionNumber.Text = $"Питання {i+1}";
                MainBlock.Text = questions[i];
                answers[i] = "YES";
                i++;
            }
            
        }

        public void No_Click(object sender, RoutedEventArgs e)
        {
            if (i+1 > 200)
            {
                Yes.IsEnabled = false;
                No.IsEnabled = false;
                ShowResult.IsEnabled = true;
            }
            else
            {
                QuestionNumber.Text = $"Питання {i+1}";
                MainBlock.Text = questions[i];
                answers[i] = "NO";
                i++;
            }
            
        }

        public void ShowResult_Click(object sender, RoutedEventArgs e)
        {
            Results();
        }

        public static string OAP_Result(int OAP)
        {
            if (OAP >= 75) return "4-Й РIВЕНЬ СТIЙКОСТI ДО БОЙОВОГО СТРЕСУ.";
            else if (OAP >= 51) return "3-Й РiВЕНЬ СТIЙКОСТI ДО БОЙОВОГО СТРЕСУ.";
            else if (OAP >= 25) return "2-Й РiВЕНЬ СТIЙКОСТI ДО БОЙОВОГО СТРЕСУ.";
            else return "1-Й РIВЕНЬ СТIЙКОСТi ДО БОЙОВОГО СТРЕСУ.";
        }
        public static string D_Result(int D)
        {
            if (D >= 10) return "результати обстеження НЕДОСТОВIРНI.Формулювання висновку не уявляється можливим.Потрiбне додаткове поглиблене обстеження. У даному випадку данi решти шкал не обраховувати.";
            else if (D >= 6) return "ДОСТАТНЯ достовiрнiсть результатiв обстеження. Окремi ознаки соцiальної бажаностi.";
            else return "ВИСОКА достовiрнiсть результатiв обстеження.";
        }
        public static string PR_Result(int PR)
        {
            if (PR >= 57) return "Вкрай високий рiвень нервово-психiчної нестiйкостi.";
            else if (PR >= 46) return "Вираженi ознаки нервово-психiчної нестiйкостi i порушення поведiнкової регуляцiї.";
            else if (PR >= 35) return "Окремi ознаки нервово-психiчної нестiйкостi i порушення поведiнкової регуляцiї.";
            else if (PR >= 27) return "Дещо понижений рiвень нервово-психiчної стiйкостi i поведiнкової регуляцiї.";
            else if (PR >= 19) return "В цiлому достатнiй рiвень нервово-психiчної стiйкостi i поведiнкової регуляцiї.";
            else if (PR >= 13) return "Достатнiй рiвень нервово-психiчної стiйкостi i поведiнкової регуляцiї.";
            else if (PR >= 9) return "Достатньо високий рiвень нервово-психiчної стiйкостi i поведiнкової регуляцiї.";
            else return "Високий рiвень нервово-психiчної стiйкостi i поведiнкової регуляцiї.";
        }
        public static string KP_Result(int KP)
        {
            if (KP >= 23) return "Вкрай низький рiвень комунiкативних здiбностей.";
            else if (KP >= 20) return "Рiвень комунiкативних здiбностей низький.";
            else if (KP >= 18) return "Понижений рiвень комунiкативних здiбностей.";
            else if (KP >= 15) return "Задовiльний рiвень комунiкативних здiбностей.";
            else if (KP >= 13) return "Рiвень комунiкативних здiбностей середнiй.";
            else if (KP >= 11) return "Достатнiй рiвень комунiкативних здiбностей.";
            else if (KP >= 9) return "Достатньо високий рiвень комунiкативних здiбностей.";
            else return "Високий рiвень комунiкативних здiбностей.";
        }
        public static string MN_Result(int MN)
        {
            if (MN >= 17) return "Вкрай низький рiвень соцiалiзацiї";
            else if (MN >= 16) return "Низький рiвень соцiалiзацiї.";
            else if (MN >= 14) return "Недостатнiй рiвень соцiалiзацiї.";
            else if (MN >= 12) return "Задовiльний рiвень соцiалiзацiї.";
            else if (MN >= 10) return "В цiлому достатнiй рiвень соцiалiзацiї.";
            else if (MN >= 8) return "Достатнiй рiвень соцiалiзацiї.";
            else if (MN >= 7) return "Достатньо високий рiвень соцiалiзацiї.";
            else if (MN >= 5) return "Високий рiвень соцiалiзацiї.";
            else return "Дуже високий рiвень соцiалiзацiї.";
        }
        public static string VPS_Result(int VPS)
        {
            if (VPS >= 14) return "Низький рiвень вiйськово-професiйної спрямованостi.";
            else if (VPS >= 11) return "Недостатнiй рiвень вiйськово-професiйної спрямованостi.";
            else if (VPS >= 8) return "В цiлому достатнiй рiвень вiйськово-професiйної спрямованостi.";
            else if (VPS >= 4) return "Достатнiй рiвень вiйськово-професiйної спрямованостi.";
            else return "Високий рiвень вiйськово-професiйної спрямованостi.";
        }
        public static string DAP_Result(int DAP)
        {
            if (DAP >= 21) return "Наявнiсть виразних ознак девiантних (аддиктивної i делинквентної) форм поведiнки.";
            else if (DAP >= 15) return "Вiдзначено наявнiсть деяких ознак девiантних (аддиктивної i делинквентної) форм поведiнки.";
            else if (DAP >= 12) return "В цiлому вираженi ознаки девiантних (аддиктивної i делинквентної) форм поведiнки вiдсутнi.";
            else return "Вiдсутнiсть  ознак девiантних (аддиктивної i делинквентної) форм поведiнки.";
        }
        public static string SR_Result(int SR)
        {
            if (SR >= 10) return "Вiдзначена наявнiсть виразних ознак суїцидальної схильностi.";
            else if (SR >= 5) return "Вiдзначена наявнiсть окремих ознак суїцидальної схильностi.";
            else if (SR >= 4) return "В цiлому виразних ознак суїцидальної схильностi не виявлено.";
            else return "Вiдсутнiсть  ознак суїцидального ризику.";
        }
    }
}
